site.org
#+title: Random bits and pieces
#+subtitle: ...about programming, languages, tools, FLOSS software...
#+author: Igor Dejanović
#+hugo_base_dir: .
#+hugo_section: /
#+options: creator:t author:nil

** Terminal/shell tricks :linux:shell:terminal:config:
:PROPERTIES:
:EXPORT_FILE_NAME: terminal-tricks
:END:

*** Useful terminal shortcuts
| Shortcut | What it does?                                                                                               |
|----------+-------------------------------------------------------------------------------------------------------------|
| C-x C-e  | Edits the current line in the $EDITOR program, or vi if undefined.                                          |
| C-x C-r  | Read in the contents of the inputrc file, and incorporate any bindings or variable assignments found there. |
| C-x C-u  | Incremental undo, separately remembered for each line.                                                      |
| C-x C-v  | Display version information about the current instance of bash.                                             |
|          | In zsh switch to line vi mode (equivalent to =bindkey -v=)? Exit with Ctrl-c                                  |
| C-x C-x  | Alternates the cursor with its old position. (C-x, because x has a crossing shape).                         |
| C-x *    | Inline shell expansion                                                                                      |

*** [[https://alacritty.org/][Alacritty]] specific

| Shortcut      | What it does?                        |
|---------------+--------------------------------------|
| Ctl-Shift-SPC | Enter vi mode. Press again to leave. |
| Ctl-Shift-C   | Copy selection                       |
| Ctl-Shift-V   | Paste clipboard content              |

**** Regex hints
- Recognizing URLs and executing open command. Put this into
  =~/.config/alacritty/alacritty.yml=:
  #+begin_src yaml
hints:
  enabled:
   - regex: "(ipfs:|ipns:|magnet:|mailto:|gemini:|gopher:|https:|http:|news:|file:|git:|ssh:|ftp:)\
              [^\u0000-\u001F\u007F-\u009F<>\"\\s{-}\\^⟨⟩`]+"
     command: xdg-open
     post_processing: true
     mouse:
       enabled: true
       mods: None
     binding:
       key: U
       mods: Control|Shift
  #+end_src

  Now you can press =Ctrl-Shift-U= to get hints overlay (a letter for each
  recognized URL on the terminal). Press the letter to execute =xdg-open= over the
  matched content (URL).

**** Color schemes with dynamic change
Nice color schemes can be found in [[https://github.com/eendroroy/alacritty-theme][eendroroy/alacritty-theme]] repo.

#+begin_src sh
git clone https://github.com/eendroroy/alacritty-theme.git ~/.alacritty-colorscheme
#+end_src

Link to default location:
#+begin_src sh
ln -s ~/.alacritty-colorscheme/themes ~/.config/alacritty/colors
#+end_src

Color scheme can be applied either statically inside alacritty config:
#+begin_src yaml
import:
  - ~/.alacritty-colorscheme/themes/{scheme_name}.yaml
#+end_src

or dynamically using [[https://github.com/toggle-corp/alacritty-colorscheme][alacritty-colorscheme]]:
#+begin_src sh
pip install --user alacritty-colorscheme
#+end_src

List schemes by:
#+begin_src sh
alacritty-colorscheme list
#+end_src

See current scheme by:
#+begin_src sh
alacritty-colorscheme status
#+end_src

Toggle by:
#+begin_src sh
alacritty-colorscheme -V toggle one_dark.yaml papercolor_light.yaml
#+end_src

Make keybinding in =~/.config/alacritty/alacritty.yml=:
#+begin_src yaml :tangle "~/.config/alacritty/alacritty.yml"
key_bindings:
  - { key: F12, command: { program: "alacritty-colorscheme", args: ["-V",  "toggle",  "one_dark.yaml",  "papercolor_light.yaml"] } }

#+end_src

**** Spawn a new instance in the same directory
Add to =~/.config/alacritty/alacritty.yml=:
#+begin_src yaml
key_bindings:
  - { key: Return,   mods: Control|Shift, action: SpawnNewInstance }
#+end_src

*** Tricks with zsh and [[https://ohmyz.sh/][oh-my-zsh]]
- https://www.sitepoint.com/zsh-commands-plugins-aliases-tools/

**** Go up to the root of Git repo :oh-my-zsh:
Put this in ~.zshrc~:
#+begin_src sh
plugins+=(git)
#+end_src

This adds alias ~grc~ that cd to the root of the repo. For other aliases see [[https://github.com/ohmyzsh/ohmyzsh/tree/master/plugins/git][here]].

[[https://stackoverflow.com/a/74648494/2024430][Source]].
